@tombuildsstuff adding my consistent reproduction of this issue here. 

Workflow to repro:
- Create Scale set (either based on custom image or marketplace image, both have the repro issue)
- Update TF to update image to custom image. (in my case, the custom image is standard_HDD in the image itself)
- Apply updated TF - this will change disk SKU to premium_SSD.
- Terraform plan will identify the issue

Example:
```tf
provider "azurerm" {
  features {}
}

resource "azurerm_resource_group" "example" {
  name     = "example-resources"
  location = "West US2"
}

resource "azurerm_virtual_network" "example" {
  name                = "example-network"
  resource_group_name = azurerm_resource_group.example.name
  location            = azurerm_resource_group.example.location
  address_space       = ["10.0.0.0/16"]
}

resource "azurerm_subnet" "internal" {
  name                 = "internal"
  resource_group_name  = azurerm_resource_group.example.name
  virtual_network_name = azurerm_virtual_network.example.name
  address_prefixes     = ["10.0.2.0/24"]
}

resource "azurerm_linux_virtual_machine_scale_set" "example" {
  name                = "example-vmss"
  resource_group_name = azurerm_resource_group.example.name
  location            = azurerm_resource_group.example.location
  sku                 = "Standard_F2s_v2"
  instances           = 1
  admin_username      = "adminuser"

  admin_ssh_key {
    username   = "adminuser"
    public_key = file("~/.ssh/id_rsa.pub")
  }
  source_image_id = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/forimage_group/providers/Microsoft.Compute/galleries/sig/images/test/versions/1.0.0"


  os_disk {
    storage_account_type = "Standard_LRS"
    caching              = "ReadWrite"
    disk_size_gb         = 100
  }

  network_interface {
    name    = "example"
    primary = true

    ip_configuration {
      name      = "internal"
      primary   = true
      subnet_id = azurerm_subnet.internal.id
    }
  }
}
````
Do terraform plan / terraform apply. This applied the right resources.

Updated terraform updating the image version
```tf
provider "azurerm" {
  features {}
}

resource "azurerm_resource_group" "example" {
  name     = "example-resources"
  location = "West US2"
}

resource "azurerm_virtual_network" "example" {
  name                = "example-network"
  resource_group_name = azurerm_resource_group.example.name
  location            = azurerm_resource_group.example.location
  address_space       = ["10.0.0.0/16"]
}

resource "azurerm_subnet" "internal" {
  name                 = "internal"
  resource_group_name  = azurerm_resource_group.example.name
  virtual_network_name = azurerm_virtual_network.example.name
  address_prefixes     = ["10.0.2.0/24"]
}

resource "azurerm_linux_virtual_machine_scale_set" "example" {
  name                = "example-vmss"
  resource_group_name = azurerm_resource_group.example.name
  location            = azurerm_resource_group.example.location
  sku                 = "Standard_F2s_v2"
  instances           = 1
  admin_username      = "adminuser"

  admin_ssh_key {
    username   = "adminuser"
    public_key = file("~/.ssh/id_rsa.pub")
  }
  source_image_id = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/forimage_group/providers/Microsoft.Compute/galleries/sig/images/test/versions/1.0.1"


  os_disk {
    storage_account_type = "Standard_LRS"
    caching              = "ReadWrite"
    disk_size_gb         = 100
  }

  network_interface {
    name    = "example"
    primary = true

    ip_configuration {
      name      = "internal"
      primary   = true
      subnet_id = azurerm_subnet.internal.id
    }
  }
}
```

The terraform plan for this is only planning to update the image_id, not the disk SKU. Terraform plan output belof:
```bash
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.example: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_linux_virtual_machine_scale_set.example: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Compute/virtualMachineScaleSets/example-vmss]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine_scale_set.example will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "example" {
        admin_username                                    = "adminuser"
        computer_name_prefix                              = "example-vmss"
        disable_password_authentication                   = true
        do_not_run_extensions_on_overprovisioned_machines = false
        encryption_at_host_enabled                        = false
        id                                                = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Compute/virtualMachineScaleSets/example-vmss"
        instances                                         = 1
        location                                          = "westus2"
        max_bid_price                                     = -1
        name                                              = "example-vmss"
        overprovision                                     = true
        priority                                          = "Regular"
        provision_vm_agent                                = true
        resource_group_name                               = "example-resources"
        scale_in_policy                                   = "Default"
        single_placement_group                            = true
        sku                                               = "Standard_F2s_v2"
      ~ source_image_id                                   = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/forimage_group/providers/Microsoft.Compute/galleries/sig/images/test/versions/1.0.0" -> "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/forimage_group/providers/Microsoft.Compute/galleries/sig/images/test/versions/1.0.1"
        tags                                              = {}
        unique_id                                         = "f1692efe-996e-4d04-95ac-de405ebd638e"
        upgrade_mode                                      = "Manual"
        zone_balance                                      = false
        zones                                             = []

        admin_ssh_key {
            public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAQEAslS5LnoCJlj8OE4VncUK2iP6YhVT/RmeNkvP3VTd/GbiZd384wrD0rzr3MwEgMm4ZkjUQno54x+bpRhIFDha4Kj89cs7LwuPHZSkXLF+aVydxy2nu464TmflnhVVW71wLE9E3bCUxmh5+IZ3sJ8is2XQMuC1IHiIoEMFc+buMTG+kVc3f+VaJ5ZT+bFPjqs816YBPTSZRmUjzfwRcLIRXvlVxlFsMckhSTa7xCCxunsGKITOnqmlk/vIWr/bKfev6RD+qV8DFquM0zxquwcSv5ERXE384m6ESJ/YJ4IN5P14CDWT3pdZtwM1jOaL/zPyMHbamk5iTPLfuPao740plQ=="
            username   = "adminuser"
        }

        automatic_instance_repair {
            enabled      = false
            grace_period = "PT30M"
        }

        network_interface {
            dns_servers                   = []
            enable_accelerated_networking = false
            enable_ip_forwarding          = false
            name                          = "example"
            primary                       = true

            ip_configuration {
                application_gateway_backend_address_pool_ids = []
                application_security_group_ids               = []
                load_balancer_backend_address_pool_ids       = []
                load_balancer_inbound_nat_rules_ids          = []
                name                                         = "internal"
                primary                                      = true
                subnet_id                                    = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal"
                version                                      = "IPv4"
            }
        }

        os_disk {
            caching                   = "ReadWrite"
            disk_size_gb              = 100
            storage_account_type      = "Standard_LRS"
            write_accelerator_enabled = false
        }
    }

  # azurerm_resource_group.example will be updated in-place
  ~ resource "azurerm_resource_group" "example" {
        id       = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources"
        location = "westus2"
        name     = "example-resources"
      ~ tags     = {
          - "CreatedOnDate" = "2020-10-28T21:53:27.0019093Z" -> null
          - "deleteByDate"  = "11/4/2020 9:53:27 PM" -> null
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"
```

After applying this, the scale set disk is updated to premium_ssd. A new terraform plan wants to change this back to standard_ssd.

```bash
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.example: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_linux_virtual_machine_scale_set.example: Refreshing state... [id=/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Compute/virtualMachineScaleSets/example-vmss]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine_scale_set.example must be replaced
-/+ resource "azurerm_linux_virtual_machine_scale_set" "example" {
        admin_username                                    = "adminuser"
      ~ computer_name_prefix                              = "example-vmss" -> (known after apply)
        disable_password_authentication                   = true
        do_not_run_extensions_on_overprovisioned_machines = false
      - encryption_at_host_enabled                        = false -> null
      ~ id                                                = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Compute/virtualMachineScaleSets/example-vmss" -> (known after apply)
        instances                                         = 1
        location                                          = "westus2"
        max_bid_price                                     = -1
        name                                              = "example-vmss"
        overprovision                                     = true
        priority                                          = "Regular"
        provision_vm_agent                                = true
        resource_group_name                               = "example-resources"
        scale_in_policy                                   = "Default"
        single_placement_group                            = true
        sku                                               = "Standard_F2s_v2"
        source_image_id                                   = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/forimage_group/providers/Microsoft.Compute/galleries/sig/images/test/versions/1.0.1"
      - tags                                              = {} -> null
      ~ unique_id                                         = "f1692efe-996e-4d04-95ac-de405ebd638e" -> (known after apply)
        upgrade_mode                                      = "Manual"
        zone_balance                                      = false
      - zones                                             = [] -> null

        admin_ssh_key {
            public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAQEAslS5LnoCJlj8OE4VncUK2iP6YhVT/RmeNkvP3VTd/GbiZd384wrD0rzr3MwEgMm4ZkjUQno54x+bpRhIFDha4Kj89cs7LwuPHZSkXLF+aVydxy2nu464TmflnhVVW71wLE9E3bCUxmh5+IZ3sJ8is2XQMuC1IHiIoEMFc+buMTG+kVc3f+VaJ5ZT+bFPjqs816YBPTSZRmUjzfwRcLIRXvlVxlFsMckhSTa7xCCxunsGKITOnqmlk/vIWr/bKfev6RD+qV8DFquM0zxquwcSv5ERXE384m6ESJ/YJ4IN5P14CDWT3pdZtwM1jOaL/zPyMHbamk5iTPLfuPao740plQ=="
            username   = "adminuser"
        }

      ~ automatic_instance_repair {
          ~ enabled      = false -> (known after apply)
          ~ grace_period = "PT30M" -> (known after apply)
        }

      + extension {
          + auto_upgrade_minor_version = (known after apply)
          + force_update_tag           = (known after apply)
          + name                       = (known after apply)
          + protected_settings         = (sensitive value)
          + provision_after_extensions = (known after apply)
          + publisher                  = (known after apply)
          + settings                   = (known after apply)
          + type                       = (known after apply)
          + type_handler_version       = (known after apply)
        }

      ~ network_interface {
          - dns_servers                   = [] -> null
            enable_accelerated_networking = false
            enable_ip_forwarding          = false
            name                          = "example"
            primary                       = true

          ~ ip_configuration {
              - application_gateway_backend_address_pool_ids = [] -> null
              - application_security_group_ids               = [] -> null
              - load_balancer_backend_address_pool_ids       = [] -> null
              - load_balancer_inbound_nat_rules_ids          = [] -> null
                name                                         = "internal"
                primary                                      = true
                subnet_id                                    = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal"
                version                                      = "IPv4"
            }
        }

      ~ os_disk {
            caching                   = "ReadWrite"
            disk_size_gb              = 100
          ~ storage_account_type      = "Premium_LRS" -> "Standard_LRS" # forces replacement
            write_accelerator_enabled = false
        }

      + terminate_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # azurerm_resource_group.example will be updated in-place
  ~ resource "azurerm_resource_group" "example" {
        id       = "/subscriptions/d19dddf3-9520-4226-a313-ae8ee08675e5/resourceGroups/example-resources"
        location = "westus2"
        name     = "example-resources"
      ~ tags     = {
          - "CreatedOnDate" = "2020-10-28T22:07:13.6413687Z" -> null
          - "deleteByDate"  = "11/4/2020 10:07:13 PM" -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"
```


